const LocaleDictionary = {
  Title: "1Globe Земля",
  Caption: {
    Major: "1Globe",
    Minor: "Земля"
  },
  Copyright: {
    Text: '© ООО "ГК 1Globe" 2020-2021, Студия ГК РнД.',
    Postfix: ""
  },
  Messages: {
    WaitTest: "Пожалуйста, подождите..."
  },
  Units: {
    Metre: "м",
    Kilometre: "км"
  },
  Menu: {
    Keys: {
      m_1:  "Описание",
      m_2:  "Настройки",
      m_3:  "О приложении",
    }
  },
  Viewer: {
    Keys: {
      s_home: "Перейти к текущему местоположению",
      s_show: "Развернуть панель поиска",
      s_hide: "Свернуть панель поиска",
      s_text: "Введите искомый текст и выберите кнопку службы",
      s_bing: "Геокодинг службы Bing Карты",
      s_yndx: "Геокодинг службы Yandex Карты",
      s_osm:  "Геокодинг службы OpenStreetMap",
      i_d:    "загрузка",
      i_u:    "распаковка",
      i_p:    "разбор",
      i_c:    "создание модели",
      l_v:    "Видимость",
      n_f:    "Вперед",
      n_b:    "Назад",
      i_cc:   "Скопировать координаты"
    }
  },
  Settings: {
    LayerDetailLink: "Подробнее...",
    Keys: {
      s_1:    "Oсновное",
      s_2:    "Слои",
      s_3:    "Кэш",
      b_1:    "Сохранить",
      b_2:    "Отменить",
      b_3:    "Сбросить",
      sb_1:   "Геолокация по IP",
      sb_1t:  "IP-адрес устройства используется для определения страны, города и почтового индекса, определяя его географическое положение.",
      sb_2:   "Кэширование изображений",
      sb_2t:  "Компонент хранит данные, чтобы последующие запросы на эти данные могли обрабатываться быстрее. Когда запрошенные данные есть в кэше, то данные беруться из кэша.",
      sb_3:   "Разрешение PWA",
      sb_3t:  "Прогрессивное веб-приложение (PWA) - это тип прикладного программного обеспечения, поставляемого через интернет. Разрешение позволяет добавить значок приложения на главный экран и запустить его.",
      sb_4:   "Высоты CGIAR CSI SRTM",
      sb_4t:  "Применение ЦМР CGIAR CSI SRTM (ЦМР - Цифровая Модель Рельефа, SRTM - Радиолокационная топографическая миссия шаттла, CSI - Консорциум пространственной информации, CGIAR - Консультативная группа по международным сельскохозяйственным исследованиям). Цифровые данные о высоте SRTM разрешения 90м, первоначально произведенные НАСА, охватывают все страны мира.",
      sb_5:   "Автономное приложение",
      sb_5t:  "Этот режим позволяет запускать приложение локально на устройстве и не требует, чтобы что-либо еще работало. Это позволит вам просматривать земной шар без активного подключения к интернету. Опция включает PWA и использует ранее загруженные данные высот SRTM и кэшированные изображения.",
      sl_1:   "Слои изображений",
      sl_2:   "Параметры слоя",
      sl_3:   "Описание слоя",
      sl_2e:  "Доступный",
      sl_2v:  "Видимость",
      sc_1:   "Общий кэш",
      sc_11:  "Это кэш всех данных.",
      sc_12:  "Всего используется",
      sc_13:  "Мб из",
      sc_14:  "Мб доступного пространства",
      sc_15:  "Для удаления всех данных вы можете перейти по следующим ссылкам.",
    }  
  }
}
window.LocaleDictionary = LocaleDictionary;
